app/Controllers/Admin/Profil.php

    public function profil()
    {
        $hasil = $this->ambil->Getprofil();
        //   $menu = $this->menu->
        $seleksi = array('status' => 1, 'target' => 100);
        $menu = $this->menu->where($seleksi)->findAll();
---
SELECT *
FROM `menu`
WHERE `status` = 1
AND `target` = 100