app/Models/admin/ModelGet.php

    public function GetProfil()
    {
        // $builder = $db->table('blogs');
        // $builder->select('*');
        // $builder->join('comments', 'comments.id = blogs.id');
        // $query = $builder->get();
        // Mengambil data dari tabel petugas
        $tampil = $this->db->table('transuser a');
        $tampil->select('*');
        $tampil->join('licensi b', 'b.kdlicensi=a.kdlicensi');
        $tampil->join('user c', 'c.kduser=a.kduser');
        $result = $tampil->get()->getResultObject();
---
SELECT *
FROM `transuser` `a`
JOIN `licensi` `b` ON `b`.`kdlicensi`=`a`.`kdlicensi`
JOIN `user` `c` ON `c`.`kduser`=`a`.`kduser`